CLI_DELIMITER = """
 =====================================================
"""
CLI_HEADER = r"""
      ____   __  __  _   _  _  __  __  ____  ____
     / __ \ |  \/  || \ | || ||  \/  || ___||  _ \
    | |  | || \  / ||  \| || || \  / || |_  | | | |
    | |  | || |\/| || . ` || || |\/| ||  _| | | | |
    | |__| || |  | || |\  || || |  | || |__ | |_| |
     \____/ |_|  |_||_| \_||_||_|  |_||____||____/
"""
CLI_MENU_NAV = """
 ----------------[ Navigation ]--------------------
 | Naviguer     -> Haut/Bas | Saut sect.-> Tab    |
 | Tout Sélect. -> Ctrl+A   | Sélect.   -> Espace |
 | Éff. filtre  -> Ctrl+Bck | Quitter   -> Échap. |
 |                          | Démarrer  -> Entrer |
 --------------------------------------------------
"""
CLI_MENU_PR = """
 ----------------[ Navigation ]--------------------
 | Quitter  -> Échape                             |
 --------------------------------------------------
"""
CLI_MENU_REPORT = """
 ----------------[ Navigation ]--------------------
 | Continuer -> Entrer | Quitter -> Échape        |
 --------------------------------------------------
"""
CLI_PROGRESS_BLOCK = """
 ----------------[ Progression ]-------------------
 | {done:>4} solution(s) compilées                     |
 | {prog:>4} solution(s) en cours                      |
 | {wait:>4} solution(s) en attente                    |
 --------------------------------------------------
"""
